Repository: Ezhil-Language-Foundation/open-tamil
Catalog: webapp/locale/*/LC_MESSAGES/django.po
Languages: ta

source: Tamil Number
ta: தமிழ் எண்கள்

source: Anagram
ta: அனாகிராம்

source: Check
ta: சரி பார்

source: cheking anagrams. Please Wait...
ta: அனாகிராம் சரிபார்க்கப் படுகிறது, காத்திருக்கவும்...

source: Word Classifier
ta: சொல் மொழி பகுப்பாய்வு - செயற்கை நுண்ணறிவு

source: Welcome to OPEN TAMIL WEB!
ta: திறமூல தமிழ் வலைத்தளம் தங்களை வரவேற்கிறது!

source: open tamil can also be used as a python library or as a webservice from other applications. Open tamil is currently under development. If you are interested in contributing contact
ta: ஓப்பன் தமிழ் பைத்தான் மொழியின் ஒரு நூலகமாகவோ அல்லது இணையசேவையாகவோ வேறொரு பயன்பாடுகளிலும் உபயோகிக்கலாம். ஓப்பன் தமிழ் தற்பொழுது மேம்பாட்டில் உள்ளது. மேம்பாட்டில் பங்களிக்க விருப்பம் உடையவர்கள் தொடர்பு கொள்ளவும்

source: the developers
ta: மேம்படுத்துபவர்கள்

source: Word Count
ta: சொல் எண்ணி

source: Count
ta: கணக்கிடு

source: No of Word is
ta: மொத்த சொற்கள்

source: and No of letter is
ta: மற்றும் மொத்த எழுத்துகள்

source: Open-Tamil Web
ta: ஓப்பன்-தமிழ் திறமூல வலைதளம்

source: Eng
ta: ஆங்கிலம்

source: Documentation
ta: ஆவணமாக்கம்

source: Applications
ta: பயன்பாடுகள்

source: Text to Speech Synthesizer
ta: உரை ஒலி மாற்றி

source: Classifier
ta: சொல் மொழி பகுப்பாய்வு - செயற்கை நுண்ணறிவு

source: Crossword
ta: சொல் தேடல் - குறுக்கெழுத்து

source: Tamil Stemmer
ta: தமிழ் வேர்ச்சொல் பகுப்பாய்வு

source: Sandhi Checker
ta: தமிழ் சந்திப்பிழை திருத்தி

source: Tamil Multiplication Tables
ta: பெருக்கல் அட்டவணை

source: Transliteration
ta: ஒலிபெயர்ப்பி

source: Tamil Spell Checker
ta: தமிழ் எழுத்துப் பிழைதிருத்தி

source: Unicode Converter
ta: ஒறுங்குறி (யுனிகோட்) மாற்றி

source: Tamil N-gram
ta: தமிழ் N-கிராம்

source: Tamil game Minnal
ta: தமிழ் மின்னல் விளையாட்டு

source: Tamil Unigram
ta: தமிழ் யுனிகிராம்

source: Tamil Anagram
ta: தமிழ் அனாகிராம்

source: Reverse Words
ta: சொல்லை திருப்பி எழுது

source: Text summarizer
ta: தமிழ் உரை சுருக்கி

source: Tamil Morse code
ta: தமிழில் மோர்சு குறியீடு (தந்தி)

source: Open-Tamil version
ta: ஓப்பன்-தமிழ் வரிசை எண்

source: Morse Code for Tamil letters
ta: தமிழ் எழுத்துக்களுக்கு மோர்சு குறியீடு (தந்தி)

source: Encoding
ta: குறியீடாக்கம்

source: Decoding
ta: குறியீடுமீளாக்கம்

source: Numeral - convert a given number (integer or float) into a numeral in Indian or American based system.
ta: கொடுக்கப்பட்ட எண்ணிற்கு இணையான தமிழ் வார்த்தைகள் கொடுக்கப்படும்

source: Please Enter the Number
ta: எண்களை உள்ளிடு

source: Indian Standard
ta: இந்தியத் தரநிலை

source: American Standard
ta: அமெரிக்கத் தரநிலை

source: Spellchecker
ta: எழுத்துப் பிழைதிருத்தி

source: This is a demo of spellcheck service of . In this page, you can enter a word for checking the spelling and just get the result.
ta: சொல் அளவிலான சொல்திருத்தி சேவை

source: For using open tamil web spellcheck service in your web or desktop applications
ta: சொல்திருத்தி சேவைகள்

source: Check Spelling
ta: எழுத்துப் பிழையை சரி பார்

source: checking spelling. Please Wait...
ta: எழுத்துப் பிழை சரிபார்க்கப் படுகிற

source: Transliterator
ta: ஒலிபெயர்ப்பி

source: Tamil TTS Demo
ta: பரிசோதனைக்காக தமிழ் உரை->ஒலி மாற்றி (TTS)

source: Tamil TTS
ta: தமிழ் உரை->ஒலி மாற்றி (TTS)

source: Generate
ta: உறுவாக்கு

source: Unicode Convertor
ta: ஒறுங்குறி (யுனிகோட்) மாற்றி

source: Unigram
ta: யுனிகிராம் (ஓரெழுத்து புள்ளியியல்)

source: making unigram. Please Wait...
ta: N-கிராம் உருவாக்கப் படுகிறது காத்திருக்கவும்

source: Running Open-Tamil version
ta: இயக்கத்தில் பயன்படுத்துவது ஓப்பன்-தமிழ் வரிசை எண்

source: Tamil Crossword Puzzle Generator
ta: சொல் தேடல் (குறுக்கெழுத்து)

source: English
ta: ஆங்கிலம்

source: Tamil
ta: தமிழ்
